---
kind: method
id: M:Autodesk.Revit.DB.IFCExportOptions.Dispose
source: html/e4a61938-701f-1da1-07da-87fcd9f50299.htm
---
# Autodesk.Revit.DB.IFCExportOptions.Dispose Method

Releases all resources used by the IFCExportOptions

## Syntax (C#)
```csharp
public void Dispose()
```